app/controllers/friends_controller.rb

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "email", "twitter", "phone", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "first_name" = ?, "updated_at" = ?, "user_id" = ? WHERE "friends"."id" = ?  [["first_name", "Shubhamkh"], ["updated_at", "2021-07-11 09:59:25.962232"], ["user_id", 3], ["id", 7]]